book("Пушкин", "Онегин", "Эксмо", 2008).
book("Пушкин", "Пророк", "Эксмо", 2009).
book("Гоголь", "Мертвые души", "Эксмо", 2010).
book("Гоголь", "Вечера на хуторе близ Диканьки", "Эксмо", 2011).
book("Гоголь", "Вий", "Эксмо", 2012).
book("Толстой", "Война и мир", "Эксмо", 2007).
book("Толстой", "Анна Каренина", "Эксмо", 2007).
book("Лем", "Солярис", "АСТ", 2005).
book("Лем", "Сумма технологии", "АСТ", 2006).
book("Лем", "Непобедимый", "АСТ", 2005).
book("Лем", "Эдем", "АСТ", 2005).

show_all :-
    book(A, N, I, Y),
    write(A),
    write(" "),
    write(N),
    write(" "),
    write(I),
    write(" "),
    write(Y),
    write(" ").

pg :-
    (   book("Пушкин", N, I, Y),
        write(N),
        write(" "),
        write(I),
        write(" "),
        write(Y),
        write(" ")
    ;   book("Гоголь", N, I, Y),
        write(N),
        write(" "),
        write(I),
        write(" "),
        write(Y),
        write(" ")
    ).

exmo_2010 :-
    book(A, N, "Эксмо", Y),
    Y>=2010,
    write(A),
    write(" "),
    write(N),
    write(" "),
    write(Y),
    write(" ").
